/**
* @file errorcode.c
* @brief
* @author rgw
* @version v1.0
* @date 2017-02-15
*/
#include "includes.h"
#include "errorcode.h"

//
//  一定要保证code的 顺序 与头文件定义一致
//
const uint8_t *strErrorCode[100] =
{
    "无故障",
    "急停检测发生故障",
    "重力加速度传感器发生故障",
    "保护接地连续性传感器发生故障",
    "掉电状态检测器发生故障",
    "避雷器发生故障",

    "充电点1 电表通信故障",
    "充电点1 检测CP故障",
    "充电点1 检测CC故障",
    "充电点1 插枪状态检测器发生故障",
    "充电点1 B型连接枪锁状态检测器发生故障",
    "充电点1 B型连接枪锁无法锁止",
    "充电点1 L进线温度检测发生故障",
    "充电点1 N进线温度检测发生故障",
    "充电点1 B型连接温度检测点1发生故障",
    "充电点1 B型连接温度检测点2发生故障",
    "充电点1 开始充电错误",
    "充电点1 结束充电错误",

    "充电点2 电表通信故障",
    "充电点2 检测CP故障",
    "充电点2 检测CC故障",
    "充电点2 插枪状态检测器发生故障",
    "充电点2 B型连接枪锁状态检测器发生故障",
    "充电点2 B型连接枪锁无法锁止",
    "充电点2 L进线温度检测发生故障",
    "充电点2 N进线温度检测发生故障",
    "充电点2 B型连接温度检测点1发生故障",
    "充电点2 B型连接温度检测点2发生故障",
    "充电点2 开始充电错误",
    "充电点2 结束充电错误",

    "文件读写错误",
    "无目标文件",
    "其他错误",
    "读卡器故障",
    "读卡器串口奇偶校验错误",
    "读卡器串口噪声错误",
    "读卡器串口帧错误",
    "读卡器串口超载",
    "读卡器串口DMA传输错误",
    "网络模块串口奇偶校验错误",
    "网络模块串口噪声错误",
    "网络模块串口帧错误",
    "网络模块串口超载",
    "网络模块串口DMA传输错误"
};

void ThrowErrorCode(ErrorCode_t errcode, ErrorLevel_t errlevel)
{
    ErrorPackage_t package;

    package.code = errcode;
    package.level = errlevel;

    xQueueSend(xHandleQueueErrorPackage, (void *)&package, 0);
}
